tutorials/fluidSolidInteraction/collapsibleChannel/0/fluid/U.dirichletNeumann
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Allrun sets this to the steady Poiseuille flow of unit mean velocity,
// u = 6 y (1 - y), using the setPoiseuilleFlow utility
internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        // Parallel flow: zero transverse velocity, zero-gradient axial velocity
        type            directionMixed;
        refValue        uniform (0 0 0);
        refGradient     uniform (0 0 0);
        valueFraction   uniform (0 0 0 1 0 1);
        value           uniform (0 0 0);
    }
    outlet
    {
        // Parallel flow: zero transverse velocity, zero-gradient axial velocity
        type            directionMixed;
        refValue        uniform (0 0 0);
        refGradient     uniform (0 0 0);
        valueFraction   uniform (0 0 0 1 0 1);
        value           uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    interface
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
