tutorials/fluidSolidInteraction/collapsibleChannel/0/solid/D
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }
    right
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }
    interface
    {
        type            solidTraction;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }
    top
    {
        // External pressure p_ext, ramped up over 0.25 s
        type            solidTraction;
        traction        uniform (0 0 0);
        pressureSeries
        {
            fileName    "$FOAM_CASE/constant/solid/pExt";
            outOfBounds clamp;
        }
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
