tutorials/fluidSolidInteraction/collapsibleChannel/constant/fsiProperties.iqnils
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    IQNILS;

IQNILSCoeffs
{
    // Interface patches
    solidPatch interface;
    fluidPatch interface;

    // Extrapolate the interface at the start of each time step: without the
    // predictor the first iterate of each time step carries an added-mass
    // spike
    predictor            yes;

    // Do not solve the solid with the old fluid load before the first fluid
    // solve: the wall is nearly massless, so that solid solution jumps
    // towards the new external pressure, and passing it to the fluid
    // unrelaxed gives a large added-mass pressure
    predictSolid         no;

    // Under-relaxation factor for the second iteration of each time step (the
    // first is not relaxed with predictor yes, and without the solid predictor
    // it only passes the previous time step's converged residual).
    // The massless wall is only held back by the added mass of the fluid, so
    // the factor must be small: roughly the ratio of the wall stiffness to the
    // added mass over the time step squared
    relaxationFactor 0.005;

    // Tolerance for the FSI loop within each time-step: the interface
    // residual relative to the largest interface displacement, 1e-4 of which
    // is about 2e-5 m. Much tighter tolerances reach the round-off floor of the
    // solid residual on the smaller time steps
    outerCorrTolerance 1e-4;

    // Maximum number of outer FSI loop correctors within each time-step
    nOuterCorr 200;

    // Enable coupling from the start
    coupled yes;

    // The fluid and solid interface faces match
    interfaceTransferMethod directMap;

    // Drop secant modes that are small relative to the newest one, which
    // otherwise let round-off in the fluid and solid solutions blow up the
    // least-squares update
    relMinSignificant 1e-2;

    // Regularise the least-squares update: drop the directions whose QR
    // diagonal is below 1e-3 of the largest column sum, and re-orthogonalise
    // the QR factorisation. Without this an occasional near-singular update
    // moves the interface far enough to tangle the fluid mesh
    qrSolveTolerance 1e-3;
    reorthogonalizeCouplingColumns yes;

    // Do not re-use the secant modes of previous time steps: with the
    // massless wall they are nearly parallel to the new ones, and re-using
    // them made the coupling diverge or stall on some meshes and platforms
    couplingReuse 0;

    // Write fsi residuals to file
    writeResidualsToFile yes;
}

// ************************************************************************* //
