tutorials/fluidSolidInteraction/collapsibleChannel/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

// St Venant-Kirchhoff wall: the second Piola-Kirchhoff stress is linear in
// the Green strain, as in the reference Kirchhoff-Love beam. In plane strain
// the wall's axial and bending stiffness follow from E/(1 - nu^2) = 5e8 Pa
mechanical
(
    wall
    {
        type            StVenantKirchhoffElastic;
        // Regularising density: the reference wall is massless, but a
        // massless wall makes the partitioned coupling fail at small time
        // steps. rho_s = rho_f = 1 kg/m^3 moves the oomph-lib reference by
        // 0.2% of the peak deflection (see the README)
        rho             rho [1 -3 0 0 0 0 0] 1;
        E               E [1 -1 -2 0 0 0 0] 4.55e8;
        nu              nu [0 0 0 0 0 0 0] 0.3;
    }
);

// ************************************************************************* //
