tutorials/fluidSolidInteraction/collapsibleChannel/constant/solid/pExt
// External pressure p_ext(t) = 200 (1 - cos(pi t/0.25))/2 Pa for t < 0.25 s
// and 200 Pa afterwards, tabulated every 1.25e-3 s
(
    (0 0)
    (0.00125 0.01233675183)
    (0.0025 0.04934396343)
    (0.00375 0.1110125038)
    (0.005 0.1973271572)
    (0.00625 0.3082666267)
    (0.0075 0.4438035397)
    (0.00875 0.6039044545)
    (0.01 0.7885298686)
    (0.01125 0.9976342283)
    (0.0125 1.23116594)
    (0.01375 1.489067385)
    (0.015 1.771274927)
    (0.01625 2.077718938)
    (0.0175 2.408323806)
    (0.01875 2.76300796)
    (0.02 3.141683887)
    (0.02125 3.544258154)
    (0.0225 3.970631432)
    (0.02375 4.42069852)
    (0.025 4.89434837)
    (0.02625 5.391464117)
    (0.0275 5.911923105)
    (0.02875 6.455596917)
    (0.03 7.022351411)
    (0.03125 7.612046749)
    (0.0325 8.224537432)
    (0.03375 8.859672336)
    (0.035 9.517294753)
    (0.03625 10.19724242)
    (0.0375 10.89934758)
    (0.03875 11.62343699)
    (0.04 12.369332)
    (0.04125 13.13684856)
    (0.0425 13.9257973)
    (0.04375 14.73598356)
    (0.045 15.56720745)
    (0.04625 16.41926386)
    (0.0475 17.29194257)
    (0.04875 18.18502826)
    (0.05 19.09830056)
    (0.05125 20.03153415)
    (0.0525 20.98449876)
    (0.05375 21.95695927)
    (0.055 22.94867572)
    (0.05625 23.95940344)
    (0.0575 24.98889304)
    (0.05875 26.0368905)
    (0.06 27.10313726)
    (0.06125 28.18737022)
    (0.0625 29.28932188)
    (0.06375 30.40872034)
    (0.065 31.54528941)
    (0.06625 32.69874865)
    (0.0675 33.86881347)
    (0.06875 35.05519517)
    (0.07 36.25760103)
    (0.07125 37.47573437)
    (0.0725 38.70929463)
    (0.07375 39.95797747)
    (0.075 41.22147477)
    (0.07625 42.4994748)
    (0.0775 43.79166221)
    (0.07875 45.0977182)
    (0.08 46.4173205)
    (0.08125 47.75014353)
    (0.0825 49.09585842)
    (0.08375 50.45413316)
    (0.085 51.82463259)
    (0.08625 53.20701857)
    (0.0875 54.60095003)
    (0.08875 56.00608301)
    (0.09 57.42207084)
    (0.09125 58.84856414)
    (0.0925 60.28521094)
    (0.09375 61.73165676)
    (0.095 63.18754473)
    (0.09625 64.65251562)
    (0.0975 66.12620798)
    (0.09875 67.60825818)
    (0.1 69.09830056)
    (0.10125 70.59596748)
    (0.1025 72.1008894)
    (0.10375 73.612695)
    (0.105 75.13101128)
    (0.10625 76.65546361)
    (0.1075 78.18567586)
    (0.10875 79.72127046)
    (0.11 81.26186854)
    (0.11125 82.80708997)
    (0.1125 84.3565535)
    (0.11375 85.90987681)
    (0.115 87.46667664)
    (0.11625 89.02656889)
    (0.1175 90.58916867)
    (0.11875 92.15409043)
    (0.12 93.72094805)
    (0.12125 95.28935493)
    (0.1225 96.85892409)
    (0.12375 98.42926827)
    (0.125 100)
    (0.12625 101.5707317)
    (0.1275 103.1410759)
    (0.12875 104.7106451)
    (0.13 106.279052)
    (0.13125 107.8459096)
    (0.1325 109.4108313)
    (0.13375 110.9734311)
    (0.135 112.5333234)
    (0.13625 114.0901232)
    (0.1375 115.6434465)
    (0.13875 117.19291)
    (0.14 118.7381315)
    (0.14125 120.2787295)
    (0.1425 121.8143241)
    (0.14375 123.3445364)
    (0.145 124.8689887)
    (0.14625 126.387305)
    (0.1475 127.8991106)
    (0.14875 129.4040325)
    (0.15 130.9016994)
    (0.15125 132.3917418)
    (0.1525 133.873792)
    (0.15375 135.3474844)
    (0.155 136.8124553)
    (0.15625 138.2683432)
    (0.1575 139.7147891)
    (0.15875 141.1514359)
    (0.16 142.5779292)
    (0.16125 143.993917)
    (0.1625 145.39905)
    (0.16375 146.7929814)
    (0.165 148.1753674)
    (0.16625 149.5458668)
    (0.1675 150.9041416)
    (0.16875 152.2498565)
    (0.17 153.5826795)
    (0.17125 154.9022818)
    (0.1725 156.2083378)
    (0.17375 157.5005252)
    (0.175 158.7785252)
    (0.17625 160.0420225)
    (0.1775 161.2907054)
    (0.17875 162.5242656)
    (0.18 163.742399)
    (0.18125 164.9448048)
    (0.1825 166.1311865)
    (0.18375 167.3012514)
    (0.185 168.4547106)
    (0.18625 169.5912797)
    (0.1875 170.7106781)
    (0.18875 171.8126298)
    (0.19 172.8968627)
    (0.19125 173.9631095)
    (0.1925 175.011107)
    (0.19375 176.0405966)
    (0.195 177.0513243)
    (0.19625 178.0430407)
    (0.1975 179.0155012)
    (0.19875 179.9684658)
    (0.2 180.9016994)
    (0.20125 181.8149717)
    (0.2025 182.7080574)
    (0.20375 183.5807361)
    (0.205 184.4327926)
    (0.20625 185.2640164)
    (0.2075 186.0742027)
    (0.20875 186.8631514)
    (0.21 187.630668)
    (0.21125 188.376563)
    (0.2125 189.1006524)
    (0.21375 189.8027576)
    (0.215 190.4827052)
    (0.21625 191.1403277)
    (0.2175 191.7754626)
    (0.21875 192.3879533)
    (0.22 192.9776486)
    (0.22125 193.5444031)
    (0.2225 194.0880769)
    (0.22375 194.6085359)
    (0.225 195.1056516)
    (0.22625 195.5793015)
    (0.2275 196.0293686)
    (0.22875 196.4557418)
    (0.23 196.8583161)
    (0.23125 197.236992)
    (0.2325 197.5916762)
    (0.23375 197.9222811)
    (0.235 198.2287251)
    (0.23625 198.5109326)
    (0.2375 198.7688341)
    (0.23875 199.0023658)
    (0.24 199.2114701)
    (0.24125 199.3960955)
    (0.2425 199.5561965)
    (0.24375 199.6917334)
    (0.245 199.8026728)
    (0.24625 199.8889875)
    (0.2475 199.950656)
    (0.24875 199.9876632)
    (0.25 200)
    (1000 200)
)
