tutorials/fluidSolidInteraction/collapsibleChannel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3.5;

deltaT          0.025;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

functions
{
    // Wall at 25%, 50% and 75% of the elastic segment
    wallQuarter
    {
        type                solidPointDisplacement;
        point               (7.5 1 0.05);
    }
    wallMid
    {
        type                solidPointDisplacement;
        point               (10 1 0.05);
    }
    wallThreeQuarter
    {
        type                solidPointDisplacement;
        point               (12.5 1 0.05);
    }
}

// ************************************************************************* //
