tutorials/fluidSolidInteraction/collapsibleChannel/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Channel of unit width: rigid upstream section (0 < x < 5), elastic upper
// wall (5 < x < 15) and rigid downstream section (15 < x < 25)
scale 1;

vertices
(
    (0 0 0)     // 0
    (5 0 0)     // 1
    (15 0 0)    // 2
    (25 0 0)    // 3
    (0 1 0)     // 4
    (5 1 0)     // 5
    (15 1 0)    // 6
    (25 1 0)    // 7
    (0 0 0.1)   // 8
    (5 0 0.1)   // 9
    (15 0 0.1)  // 10
    (25 0 0.1)  // 11
    (0 1 0.1)   // 12
    (5 1 0.1)   // 13
    (15 1 0.1)  // 14
    (25 1 0.1)  // 15
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (40 16 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) (80 16 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (80 16 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 12 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }
    interface
    {
        type wall;
        faces
        (
            (5 13 14 6)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (4 12 13 5)
            (6 14 15 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
